aws_vpc.vpc: Refreshing state... [id=vpc-0eb1fe89dc0576ef9]
data.aws_ami.linux2_ami: Reading...
aws_subnet.private[0]: Refreshing state... [id=subnet-03acb4036889acd9d]
aws_subnet.db[1]: Refreshing state... [id=subnet-05ee11be15a53ff17]
aws_internet_gateway.igw: Refreshing state... [id=igw-02c1191b6fb0ec61f]
aws_security_group.web_sg: Refreshing state... [id=sg-0ab4a43e9d264572f]
aws_subnet.private[1]: Refreshing state... [id=subnet-0cdc1c8ae5a14fb34]
aws_subnet.db[0]: Refreshing state... [id=subnet-0c1ee98f5bbcfcaa9]
aws_route_table.public_rt: Refreshing state... [id=rtb-0be617f7d29c898fa]
aws_subnet.public[1]: Refreshing state... [id=subnet-0a714014aa2076788]
aws_subnet.public[0]: Refreshing state... [id=subnet-0fa2ffbbb4819f8cd]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group]
aws_security_group.db_sg: Refreshing state... [id=sg-04c5a2138480b2548]
aws_security_group.lb_sg: Refreshing state... [id=sg-0420551884776b351]
data.aws_availability_zone.az: Reading...
aws_route_table_association.public_rt_association[1]: Refreshing state... [id=rtbassoc-089966cfe74865f08]
aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-074dababd672a93c9]
data.aws_availability_zone.az: Read complete after 0s [id=eu-west-1c]
data.aws_ami.linux2_ami: Read complete after 3s [id=ami-0bba0a4cb75835f71]
aws_db_instance.rds: Refreshing state... [id=terraform-20220713164410976800000001]
aws_instance.web_server[1]: Refreshing state... [id=i-03aa95bd06f5f587e]
aws_instance.web_server[0]: Refreshing state... [id=i-052837441a1ba8e68]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elb.elb will be created
  + resource "aws_elb" "elb" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1c",
        ]
      + connection_draining         = true
      + connection_draining_timeout = 400
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 400
      + instances                   = [
          + "i-03aa95bd06f5f587e",
          + "i-052837441a1ba8e68",
        ]
      + internal                    = false
      + name                        = "wordpress-load-balancer"
      + security_groups             = [
          + "sg-0420551884776b351",
        ]
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                    = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + zone_id                     = (known after apply)

      + access_logs {
          + bucket        = "825144470306-terraform-state"
          + bucket_prefix = "wordpress/elb"
          + enabled       = true
          + interval      = 60
        }

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:80/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 80
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.